# Домашнее задание 2 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [1]:
import pandas as pd
import zipfile

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [2]:
data_zip = zipfile.ZipFile('Data.zip')
data_zip.extractall()

FileNotFoundError: [Errno 2] No such file or directory: 'Data.zip'

In [3]:
import glob
#работа с папкой файлов. Воспользовалась информацией с сайта https://techarks.ru/qa/python/importirujte-neskolko-fajlo-V1/

In [5]:
all_files = glob.glob(r'C:\Users\asus\иад\Data' + "/*.csv")
# таблица студентов
df_hashes = pd.concat([pd.read_csv(filename, index_col=None, header=0) for filename in all_files[:10]], axis=0)

In [6]:
# таблица с оценками
df_grades = pd.concat([pd.read_csv(filename, index_col=None, header=0) for filename in all_files[10:]], axis=0)

In [7]:
#итоговая таблица
df = pd.merge(df_hashes, df_grades, on='index', how='left')

In [8]:
df.head()

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,1,female,group C,some college,standard,completed,group1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,4,male,group C,some college,standard,none,group1,76,78,75

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [9]:
# удаление данных одного из столбцов
df = df.drop("index", axis=1)

In [10]:
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [11]:
print(df.shape)

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [12]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [13]:
#или по отдельности
numcol = list(df.select_dtypes(exclude=['object']).columns)

In [14]:
#минимум
df[numcol].min()

math score        0
reading score    17
writing score    10
dtype: int64

In [15]:
#максимум
df[numcol].max()

math score       100
reading score    100
writing score    100
dtype: int64

In [16]:
#среднее значение
df[numcol].mean()

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

In [17]:
#стандартное отклонение
df[numcol].std()

math score       15.163080
reading score    14.600192
writing score    15.195657
dtype: float64

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [18]:
df.isna().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
group                          0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [19]:
#пропущенных значений нет

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [20]:
df[['math score', 'reading score', 'writing score']].mean()

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [21]:
df.groupby('test preparation course')[numcol].mean().T

test preparation course  completed       none
math score               69.695531  64.077882
reading score            73.893855  66.534268
writing score            74.418994  64.504673

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [22]:
print(', '.join(df.lunch.unique()))

standard, free/reduced

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [23]:
df.rename(columns={'parental level of education': 'education', 'test preparation course': 'test preparation'}, inplace=True)

In [24]:
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75

**Зафиксируем минимальный балл для сдачи экзамена**

In [25]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [26]:
#Какая доля студентов сдала экзамен по математике
(df['math score'] >= passmark).mean()

0.865

In [27]:
#Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
(df[df['test preparation'] == 'completed']['math score'] >= passmark).mean()

0.9217877094972067

In [28]:
#Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?
(df[(df['test preparation'] != 'completed') & (df['gender'] == 'female')]['math score'] < passmark).mean()

0.20958083832335328

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [29]:
#Для каждой этнической группы выведите средний балл за экзамен по чтению
df.groupby('race/ethnicity')['reading score'].mean()

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64

In [30]:
#Для каждого уровня образования выведите минимальный балл за экзамен по письму
df.groupby('education')['writing score'].min()

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [31]:
import time

In [32]:
timer_begin = time.time()

d = {}
for name in df['race/ethnicity'].unique():
    d[name] = [0, 0]
    for i in range(df.shape[0]):
        if name == df['race/ethnicity'][i]:
            d[name][0] += df['reading score'][i]
            d[name][1] += 1
for key in d:
    d[key] = d[key][0]/d[key][1]
    
timer_end = time.time()

d

{'group B': 67.35263157894737,
 'group C': 69.10344827586206,
 'group A': 64.67415730337079,
 'group D': 70.03053435114504,
 'group E': 73.02857142857142}

In [33]:
timer_end - timer_begin #время решения первого пункта с помощью циклов

0.032013654708862305

In [34]:
timer_begin = time.time()

d = {}
for name in df['education'].unique():
    d[name] = []
    for i in range(df.shape[0]):
        if name == df['education'][i]:
            d[name].append(df['writing score'][i])
    d[name] = min(d[name])

timer_end = time.time()

d

{"bachelor's degree": 38,
 'some college': 19,
 "master's degree": 46,
 "associate's degree": 35,
 'high school': 15,
 'some high school': 10}

In [35]:
timer_end - timer_begin  #время решения второго пункта с помощью циклов

0.03600883483886719

In [36]:
timer_begin = time.time()
df.groupby('race/ethnicity')['reading score'].mean()
timer_end = time.time()

timer_end - timer_begin #время решения первого пункта с помощью функций pandas

0.0010099411010742188

In [37]:
timer_begin = time.time()
df.groupby('education')['writing score'].min()
timer_end = time.time()

timer_end - timer_begin #время решения второго пункта с помощью функций pandas

0.001998424530029297

время решения с помощью функций pandas на порядок меньше, чем циклами

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [38]:
import numpy as np
import matplotlib.pyplot as plt

In [39]:
df.insert(2, 'education level', 'NaN')

In [40]:
df['education level'] = df['education']
df = df.replace({'education level':{"bachelor's degree":"higher", "master's degree":"higher", "associate's degree":"higher"}})
df['education level'] = np.where((df['education level'] != ("higher")), "secondary", df['education level'])
df.head()

,gender,race/ethnicity,education level,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,higher,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,secondary,some college,standard,completed,group1,69,90,88
2,female,group B,higher,master's degree,standard,none,group1,90,95,93
3,male,group A,higher,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,secondary,some college,standard,none,group1,76,78,75

In [41]:
#средние баллы студентов по каждому предмету в зависимости от пола и уровня образования
pd.pivot_table(df,index=['education level','gender'],aggfunc={'math score':np.mean, 'reading score':np.mean, 'writing score':np.mean})

                        math score  reading score  writing score
education level gender
higher          female   66.367442      75.497674      75.893023
                male     71.217391      68.342391      66.978261
secondary       female   61.693069      70.557756      70.036304
                male     67.191275      63.701342      61.046980

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [42]:
df['Math_PassStatus'] = 'NaN'

In [43]:
df.loc[(df['math score'] < passmark), 'Math_PassStatus'] = 'F'
df.loc[(df['math score'] >= passmark), 'Math_PassStatus'] = 'P'
df.head()

,gender,race/ethnicity,education level,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus
0,female,group B,higher,bachelor's degree,standard,none,group1,72,72,74,P
1,female,group C,secondary,some college,standard,completed,group1,69,90,88,P
2,female,group B,higher,master's degree,standard,none,group1,90,95,93,P
3,male,group A,higher,associate's degree,free/reduced,none,group1,47,57,44,F
4,male,group C,secondary,some college,standard,none,group1,76,78,75,P

In [44]:
#количество студентов, сдавших и не сдавших экзамен по математике
df['Math_PassStatus'].value_counts()

P    865
F    135
Name: Math_PassStatus, dtype: int64

In [45]:
df['Reading_PassStatus'] = 'NaN'
df.loc[(df['reading score'] < passmark), 'Reading_PassStatus'] = 'F'
df.loc[(df['reading score'] >= passmark), 'Reading_PassStatus'] = 'P'
df['Reading_PassStatus'].value_counts()
#количество студентов, сдавших и не сдавших экзамен по чтению

P    910
F     90
Name: Reading_PassStatus, dtype: int64

In [46]:
df['Writing_PassStatus'] = 'NaN'
df.loc[(df['writing score'] < passmark), 'Writing_PassStatus'] = 'F'
df.loc[(df['writing score'] >= passmark), 'Writing_PassStatus'] = 'P'
df['Writing_PassStatus'].value_counts()
#количество студентов, сдавших и не сдавших экзамен по письму

P    886
F    114
Name: Writing_PassStatus, dtype: int64

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [47]:
df['OverAll_PassStatus'] = 'NaN'
df['OverAll_PassStatus'] = np.where((df['Math_PassStatus'] == ("P")) & (df['Reading_PassStatus'] == ("P")) & (df['Writing_PassStatus'] == ("P")), "P", df['OverAll_PassStatus'])

In [48]:
df['OverAll_PassStatus'] = np.where((df['OverAll_PassStatus'] != ("P")), "F", df['OverAll_PassStatus'])

In [49]:
#количество студентов, которые сдали все экзамены
(df['OverAll_PassStatus'] == "P").sum()

812

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

**В случае, если средний балл попадает на границу между оценками (т.е. равен ровно 60, 70 или 80 баллов), вы можете интерпретировать условие на своё усмотрение (т.е. можете поставить за 60 баллов оценку D, а можете - E).**

In [50]:
def GetGrade(average_mark):
    if average_mark >= 90:
        return 'A'
    elif average_mark >= 80:
        return 'B'
    elif average_mark >= 70:
        return 'C'
    elif average_mark >= 60:
        return 'D'
    elif average_mark >= 50:
        return 'E'
    else: return 'F'

In [51]:
df['Average_mark'] = df.mean(axis=1)

In [52]:
df['Grade'] = df['Average_mark'].apply(GetGrade)

In [53]:
#количество студентов, получивших каждую из оценок
df['Grade'].value_counts()

C    261
D    256
E    182
B    146
F    103
A     52
Name: Grade, dtype: int64